In [42]:
import pandas as pd

## DataFrame

In [43]:
pd.DataFrame({'Carro': [2, 6, 7], 'Moto': [3, 1, 6]})

   Carro  Moto
0      2     3
1      6     1
2      7     6

In [52]:
hobbies = pd.DataFrame({'Manoel': ['Andar à cavalo', 'Ouvir música', 'Assistir futebol'], 'Camila': ['Exercício físico', 'Ler romances', 'Pilotar moto']}, index=[1, 2, 3])
hobbies

             Manoel            Camila
1    Andar à cavalo  Exercício físico
2      Ouvir música      Ler romances
3  Assistir futebol      Pilotar moto

In [53]:
hobbies.to_csv("datasets/hobbies.csv")

## Series

In [45]:
pd.Series(list(range(0, 60, 10)))

0     0
1    10
2    20
3    30
4    40
5    50
dtype: int64

In [46]:
pd.Series([2, 4, 1], index=['Horas de estudo dia 1', 'Horas de estudo dia 2', 'Horas de estudo dia 3'], name='Tempo de estudo diário')

Horas de estudo dia 1    2
Horas de estudo dia 2    4
Horas de estudo dia 3    1
Name: Tempo de estudo diário, dtype: int64

## Reading data files

In [47]:
file = "datasets/job_data_merged_1.csv"

In [48]:
job_data = pd.read_csv(file, index_col=0)

In [49]:
# Retorna o tamanha da tabela (linhas e colunas)
job_data.shape

(1095, 5)

In [50]:
# Retorna as 5 primeiras linhas de conteúdo da tabela
job_data.head()

,Category,Workplace,Location,Department,Type
0,Business Analyst,Remote,United Kingdom,Operations,Full time
1,Business Analyst,Remote,"Makati, Metro Manila, Philippines",Aux HQ,Full time
2,Business Analyst,On-site,"Al-Dajeej, Al Farwaniyah Governorate, Kuwait",PWC Technologies,Full time
3,Business Analyst,On-site,"London, England, United Kingdom","Consultants, Advisory",Full time
4,Business Analyst,Remote,United Kingdom,Operations,Full time